{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.4", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_25", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 107], "dtype": "float32", "sparse": false, "ragged": false, "name": "leftC"}, "name": "leftC", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 107], "dtype": "float32", "sparse": false, "ragged": false, "name": "target1"}, "name": "target1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 107], "dtype": "float32", "sparse": false, "ragged": false, "name": "target2"}, "name": "target2", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 107], "dtype": "float32", "sparse": false, "ragged": false, "name": "rightC"}, "name": "rightC", "inbound_nodes": []}, {"class_name": "Average", "config": {"name": "average_5", "trainable": true, "dtype": "float32"}, "name": "average_5", "inbound_nodes": [[["target2", 0, 0, {}], ["rightC", 0, 0, {}]]]}, {"class_name": "Average", "config": {"name": "average_4", "trainable": true, "dtype": "float32"}, "name": "average_4", "inbound_nodes": [[["leftC", 0, 0, {}], ["target1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_28", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_28", "inbound_nodes": [[["leftC", 0, 0, {}], ["target1", 0, 0, {}], ["average_5", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_29", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_29", "inbound_nodes": [[["average_4", 0, 0, {}], ["target2", 0, 0, {}], ["rightC", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_48", "trainable": true, "dtype": "float32", "filters": 214, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_48", "inbound_nodes": [[["concatenate_28", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_49", "trainable": true, "dtype": "float32", "filters": 214, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_49", "inbound_nodes": [[["concatenate_29", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_70", "trainable": true, "dtype": "float32", "strides": [3], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_70", "inbound_nodes": [[["conv1d_48", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_71", "trainable": true, "dtype": "float32", "strides": [3], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_71", "inbound_nodes": [[["conv1d_49", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_167", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_167", "inbound_nodes": [[["max_pooling1d_70", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_168", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_168", "inbound_nodes": [[["max_pooling1d_71", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_163", "trainable": true, "dtype": "float32", "units": 107, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_163", "inbound_nodes": [[["dropout_167", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_164", "trainable": true, "dtype": "float32", "units": 107, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_164", "inbound_nodes": [[["dropout_168", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_30", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_30", "inbound_nodes": [[["dense_163", 0, 0, {}], ["dense_164", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_169", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_169", "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_165", "trainable": true, "dtype": "float32", "units": 214, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_165", "inbound_nodes": [[["dropout_169", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_170", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_170", "inbound_nodes": [[["dense_165", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_166", "trainable": true, "dtype": "float32", "units": 107, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_166", "inbound_nodes": [[["dropout_170", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "MainInput", "trainable": true, "dtype": "float32", "axis": 1}, "name": "MainInput", "inbound_nodes": [[["leftC", 0, 0, {}], ["dense_166", 0, 0, {}], ["rightC", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 107], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_12"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_22", "trainable": true, "dtype": "float32", "filters": 150, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_22", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_22", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_45", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_46", "trainable": true, "dtype": "float32", "units": 150, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_46", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_47", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_48", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential_1", "inbound_nodes": [[["MainInput", 0, 0, {}]]]}], "input_layers": [["leftC", 0, 0], ["target1", 0, 0], ["target2", 0, 0], ["rightC", 0, 0]], "output_layers": [["sequential_1", 1, 0]]}}, "training_config": {"loss": "mean_squared_error", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1d_48/kernel", "shape": [3, 107, 214], "dtype": "float32"}, {"name": "conv1d_48/bias", "shape": [214], "dtype": "float32"}, {"name": "conv1d_49/kernel", "shape": [3, 107, 214], "dtype": "float32"}, {"name": "conv1d_49/bias", "shape": [214], "dtype": "float32"}, {"name": "dense_163/kernel", "shape": [214, 107], "dtype": "float32"}, {"name": "dense_163/bias", "shape": [107], "dtype": "float32"}, {"name": "dense_164/kernel", "shape": [214, 107], "dtype": "float32"}, {"name": "dense_164/bias", "shape": [107], "dtype": "float32"}, {"name": "dense_165/kernel", "shape": [214, 214], "dtype": "float32"}, {"name": "dense_165/bias", "shape": [214], "dtype": "float32"}, {"name": "dense_166/kernel", "shape": [214, 107], "dtype": "float32"}, {"name": "dense_166/bias", "shape": [107], "dtype": "float32"}, {"name": "conv1d_22/kernel", "shape": [3, 107, 150], "dtype": "float32"}, {"name": "conv1d_22/bias", "shape": [150], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [150], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [150], "dtype": "float32"}, {"name": "dense_46/kernel", "shape": [150, 150], "dtype": "float32"}, {"name": "dense_46/bias", "shape": [150], "dtype": "float32"}, {"name": "dense_47/kernel", "shape": [150, 50], "dtype": "float32"}, {"name": "dense_47/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_48/kernel", "shape": [50, 1], "dtype": "float32"}, {"name": "dense_48/bias", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [150], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [150], "dtype": "float32"}]}]}